# Working with datetime in Pandas DataFrame

In [1]:
import pandas as pd
import numpy as np

### Convert strings to datetime

#### Default arguments

In [2]:
df = pd.DataFrame({'date':['3/10/2000','3/11/2000','3/12/2000'],
                   'value':[2,3,4]})

In [3]:
df

        date  value
0  3/10/2000      2
1  3/11/2000      3
2  3/12/2000      4

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    3 non-null      object
 1   value   3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [5]:
# our problem 
# date    3 non-null      object
#our date column is an object where pandas doesn't knows it of which then therefore by default
#pandas thinking it of object.

In [6]:
# Now we have to tell its a datetime object 
pd.to_datetime(df['date'])

0   2000-03-10
1   2000-03-11
2   2000-03-12
Name: date, dtype: datetime64[ns]

In [7]:
# Converted object to datetime successfully. above we can se proper datetime format in pandas
# time to update the correct datetime format in actual dataFrame
df['date'] = pd.to_datetime(df['date'])

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    3 non-null      datetime64[ns]
 1   value   3 non-null      int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 180.0 bytes

In [9]:
df

        date  value
0 2000-03-10      2
1 2000-03-11      3
2 2000-03-12      4

### Day first format

day-first format refers to the date format were the day comes before the month.

The format is usually:
DD/MM/YYYY

Pandas allows you to interpret such formats when parsing dates using the dayfirst=True argument.

Without dayfirst=True, pandas would misinterpret "01/07/2025" as January 7, 2025 (MM/DD/YYYY) instead of July 1, 2025.

important use: 
dayfirst=True tells pandas to interpret dates in DD/MM/YYYY format.

Especially useful when parsing data from countries using that format.

In [34]:
df = pd.DataFrame({'date':['3/10/2000','3/11/2000','3/12/2000'],
                   'value':[2,3,4]})
df['date']=pd.to_datetime(df['date'],dayfirst=True)

In [35]:
df

        date  value
0 2000-10-03      2
1 2000-11-03      3
2 2000-12-03      4

### Custom format

In [12]:
df = pd.DataFrame({'date':['2016-6-10 20:30:0',
                           '2016-7-1 19:45:20',
                           '2013-2-12 4:5:1'],
                   'value': [2,3,4]})
df

                date  value
0  2016-6-10 20:30:0      2
1  2016-7-1 19:45:20      3
2    2013-2-12 4:5:1      4

In [13]:
df['date'] = pd.to_datetime(df['date'], format = "%Y-%d-%m %H:%M:%S")

In [14]:
df

                 date  value
0 2016-10-06 20:30:00      2
1 2016-01-07 19:45:20      3
2 2013-12-02 04:05:01      4

### Speedup parsing with infer_datetime_format(depricated)

In [15]:
df = pd.DataFrame({'date': ['3/11/2000','3/12/2000','3/13/2000']*1000})

In [16]:
df.head()

        date
0  3/11/2000
1  3/12/2000
2  3/13/2000
3  3/11/2000
4  3/12/2000

In [17]:
# above we have thousands of date right.
# %timeit will time the parsing time by infer_datetime_format 

#%timeit pd.to_datetime(df['date'],infer_datetime_format=True)

### Handle parsing error

In [18]:
df = pd.DataFrame({'date':['3/10/2000', 'a/11/2000', '3/12/2000'],
                    'value':[2,3,4]})
df

        date  value
0  3/10/2000      2
1  a/11/2000      3
2  3/12/2000      4

In [19]:
df['date'] = pd.to_datetime(df['date'])

ValueError: time data "a/11/2000" doesn't match format "%m/%d/%Y", at position 1. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.

In [20]:
#If 'ignore', then invalid parsing will return the input.
df['date'] = pd.to_datetime(df['date'],errors='ignore') #here ignore is also depricated
df

C:\Users\ramab\AppData\Local\Temp\ipykernel_13588\1380337059.py:2: FutureWarning: errors='ignore' is deprecated and will raise in a future version. Use to_datetime without passing `errors` and catch exceptions explicitly instead
  df['date'] = pd.to_datetime(df['date'],errors='ignore') #here ignore is also depricated

        date  value
0  3/10/2000      2
1  a/11/2000      3
2  3/12/2000      4

In [21]:
#If 'coerce', then invalid parsing will be set as NaT(Not a time)
df['date'] = pd.to_datetime(df['date'],errors='coerce') 
df

        date  value
0 2000-03-10      2
1        NaT      3
2 2000-03-12      4

In [22]:
#If 'raise', then invalid parsing will raise an exception.
df['date'] = pd.to_datetime(df['date'],errors='raise') 
df

        date  value
0 2000-03-10      2
1        NaT      3
2 2000-03-12      4

### 2. Assemble a datetime from multiple columns

In [31]:
df = pd.DataFrame({'year':[2013,2023],
                   'month':[2,3],
                   'day':[5,1]})
df

   year  month  day
0  2013      2    5
1  2023      3    1

In [32]:
df['date'] = pd.to_datetime(df)

In [33]:
df

   year  month  day       date
0  2013      2    5 2013-02-05
1  2023      3    1 2023-03-01

### 3. Get year, month and day

In [38]:
df = pd.DataFrame({'name':['Tom','Andy','Lucas'],
                   'DoB': ['08-04-1932', '02-05-1997', '12-12-1832']})
df

    name         DoB
0    Tom  08-04-1932
1   Andy  02-05-1997
2  Lucas  12-12-1832

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   DoB     3 non-null      object
dtypes: object(2)
memory usage: 180.0+ bytes

In [40]:
df['DoB'] = pd.to_datetime(df['DoB'])

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   DoB     3 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(1)
memory usage: 180.0+ bytes

### Get the week of year, the day of week and leap year

In [42]:
#df['week_of_year'] = df['DoB'].dt.week 
#dt.week is depricated
#instead use dt.isocalendar().week
df['week_of_year'] = df['DoB'].dt.isocalendar().week
df['day_of_week'] = df['DoB'].dt.dayofweek             
df['is_leap_year'] = df['DoB'].dt.is_leap_year
df

    name        DoB  week_of_year  day_of_week  is_leap_year
0    Tom 1932-08-04            31            3          True
1   Andy 1997-02-05             6            2         False
2  Lucas 1832-12-12            50            2          True

#### dt.dayofweek : it returns the day of the week as an integer, where
| Day       | Value |
| --------- | ----- |
| Monday    | 0     |
| Tuesday   | 1     |
| Wednesday | 2     |
| Thursday  | 3     |
| Friday    | 4     |
| Saturday  | 5     |
| Sunday    | 6     |


 Still Available Aliases:
.dt.weekday → exact same as .dt.dayofweek

.dt.day_name() → returns the day name as string (like "Sunday")

In [43]:
df['DoB'].dt.weekday

0    3
1    2
2    2
Name: DoB, dtype: int32

In [44]:
df['DoB'].dt.day_name()

0     Thursday
1    Wednesday
2    Wednesday
Name: DoB, dtype: object

In [45]:
dw_mapping = {
    0: 'Monday',
    1: 'Tuesday',
    2: 'Wednesday',
    3: 'Thursday',
    4: 'Friday',
    5: 'Saturday',
    6: 'Sunday'
}
df['day_of_week_name'] = df['DoB'].dt.weekday.map(dw_mapping)
df

    name        DoB  week_of_year  day_of_week  is_leap_year day_of_week_name
0    Tom 1932-08-04            31            3          True         Thursday
1   Andy 1997-02-05             6            2         False        Wednesday
2  Lucas 1832-12-12            50            2          True        Wednesday

### 5.Get the age from the date of birth

In [46]:
pd.to_datetime('today').year - df['DoB'].dt.year

0     93
1     28
2    193
Name: DoB, dtype: int32

In [47]:
today = pd.to_datetime('today')
today

Timestamp('2025-06-22 19:33:15.637495')

In [49]:
df['age'] = today.year - df['DoB'].dt.year
df

,name,DoB,week_of_year,day_of_week,is_leap_year,day_of_week_name,age
0,Tom,1932-08-04,31,3,True,Thursday,93
1,Andy,1997-02-05,6,2,False,Wednesday,28
2,Lucas,1832-12-12,50,2,True,Wednesday,193

In [50]:
#above is not correct way to wish a birthday.

In [51]:
#year difference
today = pd.to_datetime('today')
diff_y = today.year - df['DoB'].dt.year

#haven't had birthday
b_md = df['DoB'].apply(lambda x: (x.month,x.day))
b_md

0      (8, 4)
1      (2, 5)
2    (12, 12)
Name: DoB, dtype: object

In [53]:
no_birthday = b_md > (today.month, today.day)
no_birthday

0     True
1    False
2     True
Name: DoB, dtype: bool

In [54]:
df['age'] = diff_y - no_birthday
df

,name,DoB,week_of_year,day_of_week,is_leap_year,day_of_week_name,age
0,Tom,1932-08-04,31,3,True,Thursday,92
1,Andy,1997-02-05,6,2,False,Wednesday,28
2,Lucas,1832-12-12,50,2,True,Wednesday,192

### 6. Improve performance by setting date column as the index

In [18]:
df = pd.read_csv('city_sales.csv', parse_dates=['date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 376433 entries, 0 to 376432
Data columns (total 3 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   date    376433 non-null  datetime64[ns]
 1   num     376433 non-null  int64
 2   city    376433 non-null  object
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 8.6+ MB

In [81]:
#parse_dates is a parameter used in pandas functions like read_csv() to automatically 
#convert specified columns (e.g., 'date') into datetime objects during data loading.

In [82]:
# This tells pandas to parse the 'date' column as datetime instead of keeping it as a plain string

In [26]:
df = df.set_index(['date'])

In [27]:
df

                     num    city
date
2015-01-01 09:00:00    4  London
2015-01-01 09:01:00    4  London
2015-01-01 09:02:00    3  London
2015-01-01 09:03:00    3  London
2015-01-01 09:04:00    3  London
...                  ...     ...
2018-06-06 09:54:00    3  London
2018-06-06 09:55:00    3  London
2018-06-06 09:56:00    3  London
2018-06-06 09:57:00    3  London
2018-06-06 09:58:00    1  London

[376433 rows x 2 columns]

### 7. Select data with a specific year and perform aggregation

In [85]:
df.loc['2018']

                     num    city
date
2018-01-01 09:00:00    2  London
2018-01-01 09:01:00    1  London
2018-01-01 09:02:00    3  London
2018-01-01 09:03:00    3  London
2018-01-01 09:04:00    3  London
...                  ...     ...
2018-06-06 09:54:00    3  London
2018-06-06 09:55:00    3  London
2018-06-06 09:56:00    3  London
2018-06-06 09:57:00    3  London
2018-06-06 09:58:00    1  London

[47211 rows x 2 columns]

In [5]:
df.loc['2018','num'].sum()

np.int64(132127)

In [20]:
### nice learning done 
df['2018'].groupby('city').sum()

KeyError: '2018'

In [40]:
df_2018 = df.loc['2018']

result = df_2018.groupby('city').sum(numeric_only=True)
print(result)

           num
city
London  132127

In [42]:
#result = df_2018.groupby('city')['num'].sum() not necessary to do

In [43]:
#result

In [41]:
df_2018

                     num    city
date
2018-01-01 09:00:00    2  London
2018-01-01 09:01:00    1  London
2018-01-01 09:02:00    3  London
2018-01-01 09:03:00    3  London
2018-01-01 09:04:00    3  London
...                  ...     ...
2018-06-06 09:54:00    3  London
2018-06-06 09:55:00    3  London
2018-06-06 09:56:00    3  London
2018-06-06 09:57:00    3  London
2018-06-06 09:58:00    1  London

[47211 rows x 2 columns]

In [44]:
# done with problem solving yaayyyyyy

### 8. Select data with a specific month or a specific day of the month

In [45]:
df.loc['2018-5']

                     num    city
date
2018-05-01 09:00:00    1  London
2018-05-01 09:01:00    4  London
2018-05-01 09:02:00    3  London
2018-05-01 09:03:00    2  London
2018-05-01 09:04:00    3  London
...                  ...     ...
2018-05-31 15:56:00    3  London
2018-05-31 15:57:00    3  London
2018-05-31 15:58:00    4  London
2018-05-31 15:59:00    2  London
2018-05-31 16:00:00    3  London

[9683 rows x 2 columns]

In [51]:
df.loc['2018-2-8']

                     num    city
date
2018-02-08 09:00:00    3  London
2018-02-08 09:01:00    4  London
2018-02-08 09:02:00    3  London
2018-02-08 09:03:00    3  London
2018-02-08 09:04:00    1  London
...                  ...     ...
2018-02-08 15:56:00    2  London
2018-02-08 15:57:00    4  London
2018-02-08 15:58:00    3  London
2018-02-08 15:59:00    2  London
2018-02-08 16:00:00    3  London

[421 rows x 2 columns]

In [59]:
cond = df.index.month == 2
df[cond]

                     num    city
date
2015-02-02 09:00:00    4  London
2015-02-02 09:01:00    3  London
2015-02-02 09:02:00    3  London
2015-02-02 09:03:00    2  London
2015-02-02 09:04:00    1  London
...                  ...     ...
2018-02-28 15:56:00    3  London
2018-02-28 15:57:00    3  London
2018-02-28 15:58:00    3  London
2018-02-28 15:59:00    2  London
2018-02-28 16:00:00    3  London

[34101 rows x 2 columns]

### 9. Select data between two dates

In [52]:
df.loc['2016':'2018']

                     num    city
date
2016-01-01 09:00:00    4  London
2016-01-01 09:01:00    3  London
2016-01-01 09:02:00    4  London
2016-01-01 09:03:00    4  London
2016-01-01 09:04:00    2  London
...                  ...     ...
2018-06-06 09:54:00    3  London
2018-06-06 09:55:00    3  London
2018-06-06 09:56:00    3  London
2018-06-06 09:57:00    3  London
2018-06-06 09:58:00    1  London

[266552 rows x 2 columns]

In [53]:
df.loc['2018-5-2 10' : '2018-5-2 11']

                     num    city
date
2018-05-02 10:00:00    2  London
2018-05-02 10:01:00    3  London
2018-05-02 10:02:00    4  London
2018-05-02 10:03:00    4  London
2018-05-02 10:04:00    4  London
...                  ...     ...
2018-05-02 11:55:00    4  London
2018-05-02 11:56:00    3  London
2018-05-02 11:57:00    4  London
2018-05-02 11:58:00    3  London
2018-05-02 11:59:00    4  London

[120 rows x 2 columns]

In [54]:
df.loc['2018-5-2 10:30' : '2018-5-2 10:45']

                     num    city
date
2018-05-02 10:30:00    3  London
2018-05-02 10:31:00    3  London
2018-05-02 10:32:00    1  London
2018-05-02 10:33:00    3  London
2018-05-02 10:34:00    3  London
2018-05-02 10:35:00    3  London
2018-05-02 10:36:00    3  London
2018-05-02 10:37:00    2  London
2018-05-02 10:38:00    3  London
2018-05-02 10:39:00    3  London
2018-05-02 10:40:00    2  London
2018-05-02 10:41:00    4  London
2018-05-02 10:42:00    3  London
2018-05-02 10:43:00    3  London
2018-05-02 10:44:00    3  London
2018-05-02 10:45:00    4  London

In [55]:
df.between_time('10:30','10:45')

                     num    city
date
2015-01-01 10:30:00    4  London
2015-01-01 10:31:00    3  London
2015-01-01 10:32:00    3  London
2015-01-01 10:33:00    3  London
2015-01-01 10:34:00    4  London
...                  ...     ...
2018-06-05 10:41:00    3  London
2018-06-05 10:42:00    3  London
2018-06-05 10:43:00    1  London
2018-06-05 10:44:00    2  London
2018-06-05 10:45:00    3  London

[14304 rows x 2 columns]

In [56]:
df['rolling_sum_backfilled'] = df['rolling_sum'].fillna(method='backfill')
df.head()

KeyError: 'rolling_sum'